[
    {
        "quoteText": "Verily, deeds are only with intentions. Verily, every person will have only what they intended. Whoever emigrated to Allah and His Messenger, then his emigration is for Allah and His Messenger. Whoever emigrated to get something in the world or to marry a woman, then his emigration is for whatever he emigrated for.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Islam is to witness that there is no God but Allah and Muhammad is the Messenger of Allah, to establish prayer, to give the alms, the fast the month of Ramadan, and to perform pilgrimage to the House if he is capable of travel.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Faith is to believe in Allah, His angels, His books, His messengers, the Last Day, and to believe in providence, both its good and its evil.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Verily, the creation of each one of you is brought together in his mother’s womb for forty days in the form of seed, then he is a clot of blood for another period, then a morsel of flesh for another period, then there is sent to him the angel who blows the breath of life into him and who is commanded regarding four matters: to write down his means of livelihood, his life span, his actions, and whether he is happy or unhappy. By Allah other than whom there is no god, verily, one of you behaves like the people of Paradise until he is but an arm’s length from it, but that which has been written overtakes him, so he behaves like the people of Hellfire and thus he enters it; and one of you behaves like the people of Hellfire until he is but an arm’s length from it, and that which has been written overtakes him, so he behaves like the people of Paradise and thus he enters it.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Whoever innovates something into this affair of ours which does not belong to it will have it rejected",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "That which is lawful is plain and that which is unlawful is plain and between the two of them are doubtful matters about which not many people know. Thus he who avoids doubtful matters clears himself in regard to his religion and his honor, but he who falls into doubtful matters falls into that which is unlawful, like the shepherd who pastures around a sanctuary, all but grazing therein. Truly every king has a sanctuary, and truly Allah’s sanctuary is His prohibitions. Truly in the body there is a morsel of flesh which, if it be whole, all the body is whole and which, if it be diseased, all of it is diseased. Truly it is the heart.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "To Allah and His Book, and His messenger, and to the leaders of the Muslims and their common folk.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "I have been ordered to Jihad (hard work or fight against the devil) against people until they testify that there is no god but Allah and that Muhammad is the messenger of Allah and until they perform the prayers and pay Jakat (Purification of the wealth by giving the poor people their rightful share), and if they do so they will have gained protection from me for their lives and property, unless [they do acts that are punishable] in accordance with Islam, and their reckoning will be with Allah the Almighty.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Avoid what I have forbidden for you, and do what I have commanded you as much as you are able. Verily, the people before you were destroyed only because of their excessive questioning and contradicting their prophets.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "O people, verily, Allah is pure and He accepts only what is pure. Verily, Allah has commanded the believers with that which He commanded His Messengers. He said: O Messengers, eat from good things and work righteousness, for indeed I am knowing of what you do(23:51); and He said: O you who believe, eat from good things with which We have provided you (2:172).",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Leave what makes you doubt to what does not make you doubt; verily, truth brings tranquility but falsehood brings doubts",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "None of you has faith until he loves for the people what he loves for himself, and until he loves a person only for the sake of Allah the Exalted",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "It is unlawful to shed the blood of a Muslim person who testifies that there is no God but Allah and that I am the Messenger of Allah except in one of three cases: the married person who commits adultery, legal retaliation for murder, and a person who leaves their religion and divides the community",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Whoever believes in Allah and the Last Day, let him speak goodness or be silent; and whoever believes in Allah and the Last Day, let him honor his neighbor; and whoever believes in Allah and the Last Day, let him honor his guest",
        "author": "Prophet Muhammad"
    },    
    {
        "quoteText": "Do not become angry.",
        "author": "Prophet Muhammad"
    },    
    {
        "quoteText": "Verily Allah has prescribed excellence in all things. Thus, if you kill, kill well; and if you slaughter, slaughter well. Let each one of you sharpen his blade and let him spare suffering to the animal he slaughters.",
        "author": "Prophet Muhammad"
    },    
    {
        "quoteText": "Fear Allah wherever you are, and follow up a bad deed with a good one and it will wipe it out, and behave well towards people.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "O boy! I will teach you some words. Be mindful of Allah and He will protect you. Be mindful of Allah and you will find Him before you. When you ask, ask from Allah; and when you seek help, seek help from Allah. Know that if the entire creation were to gather together to benefit you, then would not benefit you except if Allah willed. And if the entire creation gathered together to harm you, they would not harm you except if Allah willed. The pens have been raised and the pages dried.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "O boy! I will teach you some words. Be mindful of Allah and He will protect you. Be mindful of Allah and you will find Him before you. When you ask, ask from Allah; and when you seek help, seek help from Allah. Know that if the entire creation were to gather together to benefit you, then would not benefit you except if Allah willed. And if the entire creation gathered together to harm you, they would not harm you except if Allah willed. The pens have been raised and the pages dried.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Abu Mas’ud Uqbah reported: The Messenger of Allah, peace be upon him, said: Verily, among the words people obtained from the first prophecy are: if you feel no shame, then do as you wish.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Sufyan b. Abdulla al-Thaqafi reported: I asked the Messenger of Allah, peace be upon him, to tell me something about Islam which I would not need to ask anybody afterwards. He said:Say, “I believe in Allah,” and thereafter remain steadfast.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "He who is pleased to see a man from the people of Paradise should look to him.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Purity is half of faith and the praise of Allah fills the scale, glorification and praise fill up what is between the heavens and the earth, and prayer is a light, and charity is proof (of sincere faith), and patience is illumination, and the Quran is a proof for you or against you. All people go out early in the morning and sell themselves, either setting themselves free or destroying themselves.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "O My servants, I have forbidden oppression for Myself and have made it forbidden amongst you, so do not oppress one another. O My servants, all of you are astray except for those I have guided, so seek guidance of Me and I shall guide you. O My servants, all of you are hungry except for those I have fed, so seek food of Me and I shall feed you. O My servants, all of you are naked except for those I have clothed, so seek clothing of Me and I shall clothe you. O My servants, you sin by night and by day, and I forgive all sins, so seek forgiveness of Me and I shall forgive you. O My servants, you will not attain harming Me so as to harm Me, and you will not attain benefiting Me so as to benefit Me. O my servants, were the first of you and the last of you, the human of you and the jinn of you to become as pious as the most pious heart of any one man of you, that would not increase My kingdom in anything. O My servants, were the first of you and the last of you, the human of you and the jinn of you to be as wicked as the most wicked heart of any one man of you, that would not decrease My kingdom in anything. O My servants, were the first of you and the last of you, the human of you and the jinn of you to rise up in one place and make a request of Me, and were I to give everyone what he requested, that would not decrease what I have, any more than a needle decreases the sea if put into it. O My servants, it is but your deeds that I reckon up for you and then recompense you for, so let him who finds good praise Allah, and let him who finds other than that blame no one but himself.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Has not Allah made for you ways to give charity? In every glorification of Allah there is charity; and in every declaration of His greatness there is charity; and in praise of Him is charity; and in every declaration of His oneness there is charity; and enjoining good is charity and forbidding evil is charity; and in a man’s intimate relations with his wife is charity.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "There is charity due upon every joint of the human body; every day on which the sun rises there is a reward of charity for the one who establishes justice among people.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText": "Righteousness is to have good character and sin is what festers in your heart and you hate for people to know about it.",
        "author": "Prophet Muhammad"
    },
    {
        "quoteText":"I enjoin you to fear Allah, and to listen and obey your leaders even if he is a slave from Ethiopia. Indeed, whoever lives among you will see many differences. Beware of newly invented matters, for indeed they are misguidance. So whoever sees that must uphold my precedent (sunnah) and the precedent of the upright successors who are guided; bite onto it with you molar teeth.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"You have asked about an enormous matter, yet it is easy for whom Allah makes it easy. Worship Allah and do not associate anything with Him; establish the prayer; give the charity; fast the month of Ramadan; and perform pilgrimage to the House. Shall I not tell you about the gates of goodness? Fasting is a shield ; charity extinguishes sins just as water extinguishes fire; and the prayer of a man in the late night. They arise from their beds; they supplicate their Lord in fear and hope, and they spend from what We have provided them, and no soul knows what has been hidden for them of comfort for eyes as reward for what they used to do. Shall I not tell you about the head of the matter and its peak? The head of the matter is Islam; its pillar is the prayer; and struggle (jihad) is its peak. Shall I not tell you how to achieve all of this? May your mother be bereaved of you, O Mu’adh! Is there anything that topples people onto their faces in the Hellfire except the harvest of their tongues?",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"Verily, Allah has made duties obligatory, so do not neglect them; and He has set limits, so do not transgress them; and He has remained silent concerning things as mercy for you, not out of forgetfulness, so do not search them out.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"Renounce the world and Allah will love you, and renounce what people possess and the people will love you.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"Do not be harmed or harm others.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"If people were given in accordance with their claims, then men would claim the wealth and lives of other people; rather, the burden of proof is on the claimant, and the taking of an oath is an obligation upon him who denies the claim.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"Whoever among you sees something wrong should change it with his hands. If he is unable to do so, then with his tongue. If he is unable to do so, then at least hate it in his heart, and that is the weakest of faith.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"Do not envy, and do not outbid each other, and do not hate, and do not turn away, and do not outsell each other, and be servants of Allah as brothers. The Muslim is the brother of another Muslim. He does not wrong him or humiliate him or look down upon him. Righteousness is here, and he pointed to his chest three times. It is sufficient evil for a person to look down upon his brother Muslim. All of the Muslim is sacred to another Muslim: his life, his wealth, and his honor.”",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"He who relieves the hardship of a believer in this world, Allah will relieve his hardship on the Day of Judgment. He who makes easy what is difficult, Allah will make it easy for him in the world and the Hereafter. He who conceals the faults of a Muslim, Allah will conceal his faults in the world and the Hereafter. Allah helps the servant so long as he helps his brother. He who travels a path in search of knowledge, Allah will make easy a path to Paradise. A people do not gather together in the houses of Allah, reciting the Book of Allah and studying together, except that tranquility will descend upon them, mercy will cover them, angels will surround them, and Allah will mention them to those with Him. And he who is slow to good deeds will not be hastened by his lineage",
        "author":"Prophet Muhammad"
    },  
    {
        "quoteText":"Verily, Allah has recorded good and bad deeds and He made them clear. Whoever intends to perform a good deed but does not do it, then Allah will record it as a complete good deed, but if he intends to do it and does so, then Allah the Exalted will record it as ten good deeds up to seven hundred times as much or even more; if he intends to do a bad deed and does not do it, then Allah will record for him one complete good deed, but if he does it then Allah will record for him a single bad deed.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"Verily, Allah Almighty said: Whoever shows hostility to a friend of mine, then I have declared war upon him. My servant does not grow closer to me with anything more beloved to Me than the duties I have imposed upon him. My servant continues to draw near me with extra works until I love him. When I love him, I am his hearing with which he hears, his seeing with which he sees, his hands with which he strikes, and his foot with which he walks. Were he to ask something from me, I would surely give it to him; and if he were to ask me for refuge, I would surely grant it to him.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"Verily, Allah has pardoned my nation for their mistakes, their forgetfulness, and what they are coerced into doing.",
        "author":"Prophet Muhammad"
    },
    {
        "quoteText":"At evening do not expect to live till morning, and at morning do not expect to live till evening. Take from your health for your illness and from your life for your death. ",
        "author":"Prophet Muhammad"
    }
    
]